import 'package:flutter/widgets.dart';
import 'package:my_tameen/models/questions.dart';
import 'package:my_tameen/providers/languages.dart';
import 'package:shared_preferences/shared_preferences.dart';

class ImportantQuestions extends ChangeNotifier {
  List<int> langClicked = [1, 0];

  List<Questions> _questions = [
    Questions(
      question: "في حالة وقوع الحادث ماذا يجب عليك فعله",
      answer:
          "1 – ابلاغ الشرطة بأسرع وقت ممكن 112. \n  2 – لا تغادر مكان الحادث دون اخذ اذن من الشرطة. \n  3 – لا تترك الطرف الأخر (داعم أو مدعوم) يذهب دون أخذ رقم اللوحة. \n  4 – قم بتصوير الحادث والأضرار بهاتفك النقال. \n  5 – ابلاغ شركة التأمين عن طريق حضور المشترك وفتح ملف حادث والتأكد من احضار الاتي: \n أ / اخطار الحادث – تقرير المخفر. \n ب / دفتر المركبة.\n ج / البطاقة المدنية لصاحب المركبة. \n د / رخصة سائق المركبة أثناء الحادث.",
    ),
    Questions(
      question:
          "في حالة استلامك لوثيقة التأمين هل يمكنك الغاء الوثيقة واسترداد القيمة المدفوعة",
      answer:
          "يرجى العلم بأنه في حالة الغاء الوثيقة بعد استلامها فان الالغاء يكون خاضع لسياسة وشروط وأحكام الشركة المؤمنة حيث انه في بعض الحالات فقط يمكن للعميل الغاء الوثيقة واسترداد جزئي او كلي من قيمة التأمين لذا يرجى مراجعة الشروط والاحكام جيدا لدى الشركة التي ترغب بعمل التأمين لديها ولا يحق لك مطالبة موقع وتطبيق ماي تأمين بأي تعويض بهذا الخصوص",
    ),
    Questions(
      question:
          "متى يكون وقت وتاريخ بداية الوثيقة عند طلب وثيقة التأمين من خلال موقع وتطبيق ماي تأمين",
      answer:
          "عند طلب الوثيقة من خلالنا يجب عليك وضع التاريخ المحدد من قبلك بموعد بداية الوثيقة وعندها سنقوم بمتابعة طلبك فورا مع شركة التأمين المختارة من قبلكم وسيتم ابلاغكم بموعد اعتماد الطب واصدار الوثيقة.",
    ),
    Questions(
      question:
          "هل يكون التأمين ساري فورا عند طلب وثيقة التأمين من خلال موقع وتطبيق ماي تأمين",
      answer:
          "لا يكون التامين ساري الا بعد استيفاء جميع الشروط والاحكام الخاضعة لسياسة التطبيق وشركات التامين، كما يرجى العلم بأنه سوف يتم ارسال رسالة تأكيد من قبلنا تفيدكم بتفعيل الوثيقة فورا اصدارها أو عند استلامكم للوثيقة وسداد كافة المستحقات المطالبين بها عندها فقط يمكنك الاستفادة من التأمين.",
    ),
    Questions(
      question: "هل يوجد وقت ملزم للعميل بموعد استلام وثيقة التأمين",
      answer:
          "لا يوجد وقت ملزم لاستلام وثيقة التأمين من قبل العميل، حيث انه بمجرد اصدار الوثيقة واستيفاء العميل لجميع الشروط والاحكام ومعاينة المركبة وسداد كافة المستحقات المطالب بها لإصدار الوثيقة فانه يكون خاضع للتغطية التأمينية ولا يشترط استلام العميل للوثيقة ويحق له المطالبة بالوثيقة باي وقت ومتى شاء.",
    ),
    Questions(
      question: "عن فقدانك لوثيقة التأمين الخاصة بك ماذا افعل",
      answer:
          "في حالة فقدان وثيقة التأمين يمكنك التواصل مع شركة التامين وتزويدهم بالبيانات المطلوبة (اسم العميل - نوع السيارة – رقم اللوحة الخ...) وسنقوم الشركة بإصدار بدل فاقد اما فيما يخص رسوم اصدار بدل فاقد فان الرسوم تخضع لسياسة وشروط واحكام شركات التأمين كما يرجى العلم بأنه في حالة فقدان الوثيقة فان التأمين يكون ساري ولا يسقط بفقدان الوثيقة.",
    ),
    Questions(
      question: "هل يمكن استلام الوثيقة من قبل شخص اخر",
      answer:
          "نعم يمكن تسليم الوثيقة لاي شخص اخر بناء على طلبكم مع الاحتفاظ بحق الشركة بالرفض متى شاءت. ",
    ),
    Questions(
      question: "هل يشترط تصوير ومعاينة المركبة من قبل الشركة المؤمنة",
      answer:
          "هذا الشرط يخضع لسياسة وشروط واحكام الشركة المؤمنة كما ان معظم المركبات الحديثة لا يشترط بها المعاينة والتصوير من قبل الشركة ولكن لا يمكن إلزام الشركة بعدم المعاينة والتصوير وهذا يكون أفضل لكلا الطرفين ",
    ),
    Questions(
      question:
          "ما هوا المقصود (بعدم حق الرجوع) الموجود بالملحقات الخاصة في وثيقة تأمين السيارات: (مهم جدا)",
      answer:
          "عند مخالفة سائق المركبة للقوانين الجسيمة داخل الكويت ونشوب حادث بناء على هذه المخالفة يحق لشركة التأمين في هذه الحالة ان تقوم بالرجوع عليك ولها الحق بعدم تصليح وتغطية الضرر الناجم عن هذه المخالفة،  لكن عن اضافتك لبند عدم حق الرجوع فإنك بذألك تقوم بإلغاء هذا الشرط الممنوح لشركة التأمين وستقوم الشركة بتحمل الضرر الناتج عن هذه المخالفة والمقصود بالمخالفات الجسيمة هي ان يقوم السائق بتجاوز الاشارة الضوئية الحمراء أو السير عكس الاتجاه أو القيادة بسرعة تتجاوز الحد المسموح به من قبل الادارة العامة للمرور داخل دولة الكويت.",
    ),
    Questions(
      question: "في حالة الهلاك الكلي للمركبة",
      answer:
          "الهلاك الكلي للمركبة يخضع لسياسة وشروط واحكام الشركة المؤمنة ويكون التعويض بناء على الشروط المتفق عليها بين العميل والشركة في عقد التأمين ويختلف من شركة لأخرى لكن يجب على العميل معرفة الاتي\n  1 / عند قيام العميل بكتابة واختيار القيمة التأمينية للمركبة الذي يرغب هوا بتأمينه اقل من القيمة السوقية لها في السوق وقت وقوع الحادث فانه في هذه الحالة يكون التعويض على القيمة المدخلة والمختارة من قبل العميل (أيهما أقل).\n  2 / عند قيام العميل بكتابة واختيار القيمة التأمينية للمركبة الذي يرغب هوا بتأمينه أعلى من القيمة السوقية لها في السوق وقت وقوع الحادث فانه في هذه الحالة يكون التعويض على القيمة السوقية للمركبة (أيهما أقل).",
    ),
    Questions(
      question: "نقل ملكية المركبة من شخص الى اخر",
      answer:
          "في حالة تحويل المركبة من شخص الى اخر يجب على الشخص المؤمن ان يقوم بإبلاغ الشركة ومراجعتها خلال اسبوع واحد فقط والا تصبح الشركة غير مسئولة عن اية اضرار تصيب المركبة بعد التحويل وتعتبر الوثيقة لاغية.",
    ),
  ];

  List<Questions> get questions {
    return _questions;
  }
}
